#### TextTreatment Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible text treatment modes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextTreatment ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextTreatment ``` |

| Visual C++ |
| --- |
| ``` public enum class TextTreatment ``` |

# Members

| Member name | Description |
| --- | --- |
| Exact | Export texts as exact visual fidelity. Formatting intelligence will be lost. |
| Approximate | Export texts as approximate visual fidelity. Formatting intelligence will be maintained. |

# See Also

Autodesk.Revit.DB Namespace